/*
17:菲波那契数列
查看 提交 统计 提问
总时间限制: 1000ms 内存限制: 65536kB
描述
菲波那契数列是指这样的数列: 数列的第一个和第二个数都为1，接下来每个数都等于前面2个数之和。
给出一个正整数k，要求菲波那契数列中第k个数是多少。

输入
输入一行，包含一个正整数k。（1 <= k <= 46）
输出
输出一行，包含一个正整数，表示菲波那契数列中第k个数的大小

*/

#include <iostream>

using namespace std;

/*
int main()
{
    int k;
    cin >> k;
    long long fib[50];
    fib[1]=1;
    fib[2]=1;
    for(int i=3;i<50;i++)
    {
        fib[i] = fib[i-1]+fib[i-2];
        cout<<fib[i]<<",";
    }
    return 0;
}
*/

/*
int main()
{
    int k;
    cin >> k;
    long long fib[50]={0,1,1,2,3,5,8,13,21,34,55,89,144,233,377,610,987,1597,2584,4181,6765,10946,17711,28657,46368,75025,121393,196418,317811,514229,832040,1346269,2178309,3524578,5702887,9227465,14930352,24157817,39088169,63245986,102334155,165580141,267914296,433494437,701408733,1134903170,1836311903,2971215073,4807526976,7778742049};
    cout <<fib[k];

    return 0;
}
*/

#include<cmath>
using namespace std;
int main()
{
    int a = 1, b = 1, c = 0, n;
    cin >> n;
    for(int i = 0; i < n -2; i ++)
    {
        c = a;
        a = b;
        b = c + b;
    }
    cout << b;
    return 0;
}



